{
  "id": "subsubsection_9_5_5",
  "type": "subsubsection",
  "title": "Referencing Multi-lane Ports",
  "number": "9.5.5",
  "parent": "subsection_9_5",
  "content": "--ID: subsubsection_9_5_5\nEOS supports two types of Ethernet ports:\n\n\nsingle-lane (also called fixed-lane)\n\n• multi-lane (also called flexible-lane)\n\nSingle-lane (or “fixed-lane”) ports are always modeled as a single interface within EOS. While the speed \nof the interface may be configurable, the physical port can never be broken out into multiple \nlower-speed interfaces. Single-lane ports use the following naming scheme:\n\n\n\nEthernet<port #> (for fixed switches)\n\nEthernet<module #>/<port #> (for modular switches)\n\nMulti-lane (or “flexible lane”) ports are made up of multiple parallel lanes, each served by its own laser. \nMulti-lane ports can be configured to combine the lanes and operate as a single native high-speed \ninterface (a 40GbE or 100GbE interface), or to operate each lower-speed interface independently (four \n10GbE or 25GbE interfaces). Multi-lane ports use the following naming scheme:\n\n\n\nEthernet<port #>/<lane #> (for fixed switches)\n\nEthernet<module #>/<port #>/<lane #> (for modular switches)\n\nThe operational state displayed for each lane of a multi-lane port is determined by the configuration \napplied to the primary lane(s), as shown in [[TABLE:table_9_5]]. When broken out into multiple lower-speed \ninterfaces, all lanes will be active in parallel, and each will display its operational state as connected or \nnot connected. In high-speed mode, only the primary lane(s) will be displayed as active, with the \nremaining lanes showing as errdisabled. The exception is the CFP2 module: when it is configured as a \nsingle 100GbE port, the primary lane is displayed as active in the CLI while the other lanes are hidden.\n\n<!-- TABLE:START -->\nTable 9-5: Lane States\n| Parent Port Configured Mode | Primary Lane(s)          | Secondary Lanes           |\n|-----------------------------|--------------------------|---------------------------|\n| single high-speed interface | active (connected/not connected) | inactive (errdisabled) |\n| multi-interface breakout    | active (connected/not connected) | active (connected/not connected) |\n<!-- TABLE:END -->\n\nA multi-lane port is configured as a single high-speed interface or multiple breakout interfaces by using \nthe speed command on the primary lane(s) of the port. For specific configuration instructions and \ndetails regarding the primary lane(s) of a specific interface, refer to the configuration section for the \nappropriate interface type:\n\n• QSFP+ Ethernet Port Configuration\n\n• QSFP100 Ethernet Port Configuration\n\n• CFP2 Ethernet Port Configuration\n\n• MXP Ethernet Port Configuration\n\nImportant Use of the speed command to configure a multi-lane port is hitless on the 7050X, 7060X, 7250X, 7260X,\n7280SE, 7300X, 7320X and 7500E series platforms. On all other platforms, this command restarts the\nforwarding agent, which will result in traffic disruption.",
  "children": [],
  "code_refs": [],
  "table_refs": []
}