{
  "id": "subsubsection_2_4_4",
  "type": "subsubsection",
  "title": "Restoring the Configuration and Image from a USB Flash Drive",
  "number": "2.4.4",
  "parent": "subsection_2_4",
  "content": "--ID: subsubsection_2_4_4\nThe USB flash drive port can be used to restore an original configuration when you cannot establish a \nconnection to the console port. This process removes the contents of the internal flash drive, restores \nthe factory default configuration, and installs a new EOS image from the USB flash drive.\n\nThis procedure restores the factory default configuration and installs an EOS image stored on a USB \nflash drive.\n\nStep 1 Prepare the USB flash drive:\n\nStep a Verify the drive is formatted with MS-DOS or FAT file system.\n\nMost USB drives are pre-formatted with a compatible file system.\n\nStep b Create a text file named fullrecover on the USB flash drive.\n\nThe filename does not have an extension. The file may be empty.\n\nStep c Create a text file named boot-config.\n\nThe last modified timestamp of the boot-config file on the USB flash must differ from the \ntimestamp of the boot-config file on the switch.\n\nStep d Enter this line in the new boot-config file on the USB flash:\n\nSWI=flash:EOS.swi\n\nStep e Copy an EOS image file to the flash drive. Rename it EOS.swi if it has a different file name.\n\nFor best results, the flash drive should contain only these three files, because the procedure \ncopies all files and directories on the USB flash drive to the switch.\n\n\nfullrecover\nboot-config\nEOS.swi\n\nStep 2 Insert the USB flash drive into the USB flash port on the switch, as shown in Figure 2-1.\n\nStep 3 Connect a terminal to the console port and configure it with the default terminal settings \n\n(9600/N/8/1) to monitor progress messages on the console.\n\nStep 4 Power up or reload the switch.\n\nThe switch erases internal flash contents and copies the files from the USB flash drive to internal \nflash. The switch then boots automatically.\n\nStep 5 Cancel Zero Touch Provisioning (ZTP). Refer to Section 2.1.2.2: Cancelling Zero Touch \n\nProvisioning for instructions.\n\nIf ZTP is not cancelled, the switch either:\n\n\nboots, using the startup-config file or boot script that it obtains from the network, or\nremains in ZTP mode if the switch is unable to download a startup-config file or boot script.\n\nAfter ZTP is cancelled, the switch reboots using the factory default settings. To avoid entering \nZTP mode on subsequent reboots, create a startup-config file before the next switch reboot.",
  "children": [],
  "code_refs": [],
  "table_refs": []
}